In [ ]:
import pandas as pd
import sqlite3

In [ ]:
# Loading data into a DataFrame
df = pd.read_csv("/content/animals.csv")

# Using a context manager to handle the database connection
with sqlite3.connect('zoo_data.db') as connection:
    # Creating a table and loading data into the database
    df.to_sql('animals', connection, if_exists='replace', index=False)

In [ ]:
# Loading the SQL magic
%load_ext sql

In [ ]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [ ]:
# Connecting to the SQLite database
%sql sqlite:///zoo_data.db

In [ ]:
%%sql
SELECT * FROM animals;

 * sqlite:///zoo_data.db
Done.

[(1, 'Leo', 'Lion', 5, 'Savannah'),
 (2, 'Ellie', 'Elephant', 10, 'Grasslands'),
 (3, 'Zara', 'Zebra', 7, 'Savannah'),
 (4, 'Manny', 'Monkey', 3, 'Tropical Forest'),
 (5, 'Gerry', 'Giraffe', 8, 'Savannah'),
 (6, 'Perry', 'Penguin', 4, 'Polar'),
 (7, 'Tina', 'Tiger', 6, 'Rainforest'),
 (8, 'Rocky', 'Rhinoceros', 12, 'Grasslands'),
 (9, 'Sammy', 'Snake', 2, 'Desert'),
 (10, 'Bella', 'Bear', 9, 'Forest')]

In [ ]:
%%sql
DROP TABLE animals;

 * sqlite:///zoo_data.db
Done.

[]

In [ ]:
import csv

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS animals (
    animal_id INTEGER PRIMARY KEY,
    name TEXT VARCHAR(255) NOT NULL,
    species TEXT,
    age INTEGER,
    habitat TEXT
 );

 * sqlite:///zoo_data.db
Done.

[]

In [ ]:
# Connect to SQLite database
connection = sqlite3.connect('zoo_data.db')
# Create cursor object
cursor = connection.cursor()

# Open the CSV file and read its content
file = "/content/animals.csv"


with open(file, 'r') as csv_file:
    csv_reader = csv.reader(csv_file)
    # Skip the header row
    next(csv_reader)
    # Insert data into the table
    for row in csv_reader:
        cursor.execute('INSERT INTO animals VALUES (?, ?, ?, ?, ?)', row)

# Commit the changes and close the connection
connection.commit()
connection.close()

In [ ]:
%%sql
SELECT * FROM animals;

 * sqlite:///zoo_data.db
Done.

[(1, 'Leo', 'Lion', 5, 'Savannah'),
 (2, 'Ellie', 'Elephant', 10, 'Grasslands'),
 (3, 'Zara', 'Zebra', 7, 'Savannah'),
 (4, 'Manny', 'Monkey', 3, 'Tropical Forest'),
 (5, 'Gerry', 'Giraffe', 8, 'Savannah'),
 (6, 'Perry', 'Penguin', 4, 'Polar'),
 (7, 'Tina', 'Tiger', 6, 'Rainforest'),
 (8, 'Rocky', 'Rhinoceros', 12, 'Grasslands'),
 (9, 'Sammy', 'Snake', 2, 'Desert'),
 (10, 'Bella', 'Bear', 9, 'Forest')]

In [ ]:
%%sql
SELECT name, species
FROM animals;

 * sqlite:///zoo_data.db
Done.

[('Leo', 'Lion'),
 ('Ellie', 'Elephant'),
 ('Zara', 'Zebra'),
 ('Manny', 'Monkey'),
 ('Gerry', 'Giraffe'),
 ('Perry', 'Penguin'),
 ('Tina', 'Tiger'),
 ('Rocky', 'Rhinoceros'),
 ('Sammy', 'Snake'),
 ('Bella', 'Bear')]

In [ ]:
%%sql
SELECT animal_id, name, species
FROM animals
LIMIT 5;

 * sqlite:///zoo_data.db
Done.

[(1, 'Leo', 'Lion'),
 (2, 'Ellie', 'Elephant'),
 (3, 'Zara', 'Zebra'),
 (4, 'Manny', 'Monkey'),
 (5, 'Gerry', 'Giraffe')]

In [ ]:
%%sql
SELECT
    animal_id,
    name,
    species
FROM animals
LIMIT 5 OFFSET 5;

 * sqlite:///zoo_data.db
Done.

[(6, 'Perry', 'Penguin'),
 (7, 'Tina', 'Tiger'),
 (8, 'Rocky', 'Rhinoceros'),
 (9, 'Sammy', 'Snake'),
 (10, 'Bella', 'Bear')]

In [ ]:
%%sql
SELECT
    name,
    species,
    age
FROM animals
ORDER BY age DESC
LIMIT 3;

 * sqlite:///zoo_data.db
Done.

[('Rocky', 'Rhinoceros', 12), ('Ellie', 'Elephant', 10), ('Bella', 'Bear', 9)]

In [ ]:
%%sql
SELECT name, species,age
FROM animals
ORDER BY age
LIMIT 3;

 * sqlite:///zoo_data.db
Done.

[('Sammy', 'Snake', 2), ('Manny', 'Monkey', 3), ('Perry', 'Penguin', 4)]

In [ ]:
%%sql
SELECT name, species,age
FROM animals
ORDER BY age ASC -- Explicitly passing ASC
LIMIT 3;

 * sqlite:///zoo_data.db
Done.

[('Sammy', 'Snake', 2), ('Manny', 'Monkey', 3), ('Perry', 'Penguin', 4)]

In [ ]:
%%sql
SELECT animal_id, habitat,  name, species, age
FROM animals
-- Sorting by two columns
ORDER BY habitat DESC, age ASC;

 * sqlite:///zoo_data.db
Done.

[(4, 'Tropical Forest', 'Manny', 'Monkey', 3),
 (1, 'Savannah', 'Leo', 'Lion', 5),
 (3, 'Savannah', 'Zara', 'Zebra', 7),
 (5, 'Savannah', 'Gerry', 'Giraffe', 8),
 (7, 'Rainforest', 'Tina', 'Tiger', 6),
 (6, 'Polar', 'Perry', 'Penguin', 4),
 (2, 'Grasslands', 'Ellie', 'Elephant', 10),
 (8, 'Grasslands', 'Rocky', 'Rhinoceros', 12),
 (10, 'Forest', 'Bella', 'Bear', 9),
 (9, 'Desert', 'Sammy', 'Snake', 2)]

In [ ]:
%%sql
SELECT 'savannah' AS habitat

UNION ALL -- Combining two queries

SELECT 'Tropical Forest' AS habitat
ORDER BY habitat ASC;

 * sqlite:///zoo_data.db
Done.

[('Tropical Forest',), ('savannah',)]

In [ ]:
%%sql
SELECT 'savannah' AS habitat

UNION ALL -- Combining two queries

SELECT 'Tropical Forest'
ORDER BY habitat COLLATE NOCASE ASC;

 * sqlite:///zoo_data.db
Done.

[('savannah',), ('Tropical Forest',)]

In [ ]:
%%sql
SELECT animal_id, habitat,  name, species, age
FROM animals
ORDER BY habitat DESC
LIMIT 5;

 * sqlite:///zoo_data.db
Done.

[(4, 'Tropical Forest', 'Manny', 'Monkey', 3),
 (1, 'Savannah', 'Leo', 'Lion', 5),
 (3, 'Savannah', 'Zara', 'Zebra', 7),
 (5, 'Savannah', 'Gerry', 'Giraffe', 8),
 (7, 'Rainforest', 'Tina', 'Tiger', 6)]

In [ ]:
%%sql
SELECT animal_id, habitat,  name, species, age
FROM animals
ORDER BY LENGTH(name) DESC
LIMIT 5;

 * sqlite:///zoo_data.db
Done.

[(2, 'Grasslands', 'Ellie', 'Elephant', 10),
 (4, 'Tropical Forest', 'Manny', 'Monkey', 3),
 (5, 'Savannah', 'Gerry', 'Giraffe', 8),
 (6, 'Polar', 'Perry', 'Penguin', 4),
 (8, 'Grasslands', 'Rocky', 'Rhinoceros', 12)]

In [ ]:
%%sql
SELECT * FROM animals
WHERE age = 2;

 * sqlite:///zoo_data.db
Done.

[(9, 'Sammy', 'Snake', 2, 'Desert')]

In [ ]:
%%sql
SELECT * FROM animals
WHERE age > 5 AND habitat = 'Savannah';

 * sqlite:///zoo_data.db
Done.

[(3, 'Zara', 'Zebra', 7, 'Savannah'), (5, 'Gerry', 'Giraffe', 8, 'Savannah')]

In [ ]:
%%sql
SELECT * FROM animals
WHERE age > 5 OR habitat = 'Savannah';

 * sqlite:///zoo_data.db
Done.

[(1, 'Leo', 'Lion', 5, 'Savannah'),
 (2, 'Ellie', 'Elephant', 10, 'Grasslands'),
 (3, 'Zara', 'Zebra', 7, 'Savannah'),
 (5, 'Gerry', 'Giraffe', 8, 'Savannah'),
 (7, 'Tina', 'Tiger', 6, 'Rainforest'),
 (8, 'Rocky', 'Rhinoceros', 12, 'Grasslands'),
 (10, 'Bella', 'Bear', 9, 'Forest')]

In [ ]:
%%sql
SELECT * FROM animals
WHERE (age > 5 OR habitat = 'Savannah')
      AND species = 'Lion';

 * sqlite:///zoo_data.db
Done.

[(1, 'Leo', 'Lion', 5, 'Savannah')]

In [ ]:
%%sql
SELECT * FROM animals
WHERE name LIKE '%y';

 * sqlite:///zoo_data.db
Done.

[(4, 'Manny', 'Monkey', 3, 'Tropical Forest'),
 (5, 'Gerry', 'Giraffe', 8, 'Savannah'),
 (6, 'Perry', 'Penguin', 4, 'Polar'),
 (8, 'Rocky', 'Rhinoceros', 12, 'Grasslands'),
 (9, 'Sammy', 'Snake', 2, 'Desert')]

In [ ]:
%%sql
SELECT * FROM animals
WHERE name LIKE 'R%y';

 * sqlite:///zoo_data.db
Done.

[(8, 'Rocky', 'Rhinoceros', 12, 'Grasslands')]

In [ ]:
%%sql
SELECT * FROM animals
WHERE name LIKE '%er%';

 * sqlite:///zoo_data.db
Done.

[(5, 'Gerry', 'Giraffe', 8, 'Savannah'), (6, 'Perry', 'Penguin', 4, 'Polar')]

In [ ]:
%%sql
SELECT * FROM animals
WHERE name LIKE '_e_r%';

 * sqlite:///zoo_data.db
Done.

[(5, 'Gerry', 'Giraffe', 8, 'Savannah'), (6, 'Perry', 'Penguin', 4, 'Polar')]

In [ ]:
%%sql
SELECT * FROM animals
WHERE name LIKE 'm%';

 * sqlite:///zoo_data.db
Done.

[(4, 'Manny', 'Monkey', 3, 'Tropical Forest')]

In [ ]:
%%sql
SELECT * FROM animals
WHERE name GLOB 'm*';

 * sqlite:///zoo_data.db
Done.

[]

In [ ]:
%%sql
SELECT * FROM animals
WHERE age BETWEEN 3 AND 5;

 * sqlite:///zoo_data.db
Done.

[(1, 'Leo', 'Lion', 5, 'Savannah'),
 (4, 'Manny', 'Monkey', 3, 'Tropical Forest'),
 (6, 'Perry', 'Penguin', 4, 'Polar')]

In [ ]:
%%sql
SELECT * FROM animals
WHERE name BETWEEN 'L' AND 'T';

 * sqlite:///zoo_data.db
Done.

[(1, 'Leo', 'Lion', 5, 'Savannah'),
 (4, 'Manny', 'Monkey', 3, 'Tropical Forest'),
 (6, 'Perry', 'Penguin', 4, 'Polar'),
 (8, 'Rocky', 'Rhinoceros', 12, 'Grasslands'),
 (9, 'Sammy', 'Snake', 2, 'Desert')]

In [ ]:
%%sql
SELECT * FROM animals
WHERE habitat BETWEEN 'Polar'
      AND 'Savannah';

 * sqlite:///zoo_data.db
Done.

[(1, 'Leo', 'Lion', 5, 'Savannah'),
 (3, 'Zara', 'Zebra', 7, 'Savannah'),
 (5, 'Gerry', 'Giraffe', 8, 'Savannah'),
 (6, 'Perry', 'Penguin', 4, 'Polar'),
 (7, 'Tina', 'Tiger', 6, 'Rainforest')]

In [ ]:
%%sql
SELECT name, age
FROM animals
WHERE name IN ('Perry', 'Zara', 'Sammy');

 * sqlite:///zoo_data.db
Done.

[('Zara', 7), ('Perry', 4), ('Sammy', 2)]

In [ ]:
%%sql
SELECT name, age
FROM animals
WHERE name = 'Perry' OR name = 'Zara'
              OR name = 'Sammy';

 * sqlite:///zoo_data.db
Done.

[('Zara', 7), ('Perry', 4), ('Sammy', 2)]

In [ ]:
%%sql
SELECT DISTINCT habitat
FROM animals;

 * sqlite:///zoo_data.db
Done.

[('Savannah',),
 ('Grasslands',),
 ('Tropical Forest',),
 ('Polar',),
 ('Rainforest',),
 ('Desert',),
 ('Forest',)]

In [ ]:
%%sql
SELECT DISTINCT name, habitat
FROM animals;

 * sqlite:///zoo_data.db
Done.

[('Leo', 'Savannah'),
 ('Ellie', 'Grasslands'),
 ('Zara', 'Savannah'),
 ('Manny', 'Tropical Forest'),
 ('Gerry', 'Savannah'),
 ('Perry', 'Polar'),
 ('Tina', 'Rainforest'),
 ('Rocky', 'Grasslands'),
 ('Sammy', 'Desert'),
 ('Bella', 'Forest')]

In [ ]:
%%sql
SELECT DISTINCT habitat
FROM (
    SELECT 'Savannah' AS habitat
    UNION
    SELECT 'SAVANNAH'
);

 * sqlite:///zoo_data.db
Done.

[('SAVANNAH',), ('Savannah',)]

In [ ]:
%%sql
SELECT DISTINCT LOWER(habitat) AS habitat
FROM (
    SELECT 'Savannah' AS habitat
    UNION ALL
    SELECT 'SAVANNAH'
);

 * sqlite:///zoo_data.db
Done.

[('savannah',)]

In [ ]:
%%sql
SELECT DISTINCT habitat COLLATE NOCASE AS habitat
FROM (
    SELECT 'Savannah' AS habitat
    UNION ALL
    SELECT 'SAVANNAH'
);

 * sqlite:///zoo_data.db
Done.

[('Savannah',)]

In [ ]:
%%sql
SELECT COUNT(habitat) AS number_of_values_in_habitat
FROM animals;

 * sqlite:///zoo_data.db
Done.

[(10,)]

In [ ]:
%%sql
SELECT COUNT(DISTINCT(habitat))
        AS unique_values_in_habitat
FROM animals;

 * sqlite:///zoo_data.db
Done.

[(7,)]

In [ ]:
%%sql
SELECT COUNT(*) AS total_rows_in_table
FROM animals;

 * sqlite:///zoo_data.db
Done.

[(10,)]

In [ ]:
%%sql
SELECT COUNT(*) AS number_of_savannah_rows
FROM animals
WHERE habitat = 'Savannah';

 * sqlite:///zoo_data.db
Done.

[(3,)]

In [ ]:
%%sql
SELECT MIN(age) AS age_of_youngest_animal
FROM animals;

 * sqlite:///zoo_data.db
Done.

[(2,)]

In [ ]:
%%sql
SELECT MIN(name) AS lexicographically_min_name
FROM animals;

 * sqlite:///zoo_data.db
Done.

[('Bella',)]

In [ ]:
%%sql
SELECT MAX(age) AS age_of_oldest_animal
FROM animals;

 * sqlite:///zoo_data.db
Done.

[(12,)]

In [ ]:
%%sql
SELECT SUM(age) AS total_age_of_forest_animals
FROM animals
WHERE habitat LIKE '%forest';

 * sqlite:///zoo_data.db
Done.

[(18,)]

In [ ]:
%%sql
SELECT SUM(age) AS total_age_of_forest_animals
FROM animals
-- Explicitly suppress case-sensitivity
WHERE habitat LIKE '%forest' COLLATE NOCASE;

 * sqlite:///zoo_data.db
Done.

[(18,)]

In [ ]:
%%sql
SELECT AVG(age) AS average_age_of_not_forest_animals
FROM animals
WHERE habitat NOT LIKE '%forest';

 * sqlite:///zoo_data.db
Done.

[(6.857142857142857,)]

In [ ]:
%%sql
SELECT
    habitat,
    COUNT(species) AS count_of_animals_in_each_habitat
FROM animals;

 * sqlite:///zoo_data.db
Done.

[('Savannah', 10)]

In [ ]:
%%sql
SELECT
    habitat,
    COUNT(species) AS count_of_animals_in_each_habitat
FROM animals
GROUP BY habitat;

 * sqlite:///zoo_data.db
Done.

[('Desert', 1),
 ('Forest', 1),
 ('Grasslands', 2),
 ('Polar', 1),
 ('Rainforest', 1),
 ('Savannah', 3),
 ('Tropical Forest', 1)]

In [ ]:
%%sql
SELECT
    habitat,
    COUNT(species) AS count_of_animals_in_each_habitat
FROM animals
GROUP BY habitat
ORDER BY count_of_animals_in_each_habitat DESC
LIMIT 1;

 * sqlite:///zoo_data.db
Done.

[('Savannah', 3)]

In [ ]:
%%sql
SELECT
       habitat,
       SUM(age) AS total_age_in_each_habitat
FROM animals
WHERE habitat IN ('Rainforest', 'Forest')
GROUP BY habitat
ORDER BY total_age_in_each_habitat ASC;

 * sqlite:///zoo_data.db
Done.

[('Rainforest', 6), ('Forest', 9)]

In [ ]:
%%sql
SELECT
    habitat,
    SUM(age) AS total_age_in_each_habitat
FROM animals
WHERE habitat IN ('Rainforest', 'Forest')
GROUP BY habitat
HAVING habitat = 'Forest';

 * sqlite:///zoo_data.db
Done.

[('Forest', 9)]

In [ ]:
%%sql
SELECT
    habitat,
    SUM(age) AS total_age_in_each_habitat
FROM animals
GROUP BY habitat
HAVING SUM(age) < 10; -- aggregate function with HAVING clause

 * sqlite:///zoo_data.db
Done.

[('Desert', 2),
 ('Forest', 9),
 ('Polar', 4),
 ('Rainforest', 6),
 ('Tropical Forest', 3)]